##################
# Primary Clocks #
##################

# Differential input clock from SI570 clock synthesizer
# Constrained to 148.5MHz (1080p60 video resolution)
create_clock -period 6.734 -name si570_clk [get_ports si570_clk_p]

# Single-ended input clock from HDMI input
# Constrained to 148.5MHz (1080p60 video resolution)
create_clock -period 6.734 -name hdmii_clk [get_ports fmc_imageon_hdmii_clk]

####################
# Generated Clocks #
####################

# Rename auto-generated clocks from clk_wiz_1
# Axi-lite clock 50MHz
create_generated_clock -name clk50 [get_pins system_top_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]
# AXI Stream and MemoryMap clock 150Mhz
create_generated_clock -name clk150 [get_pins system_top_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT1]

################
# Clock Groups #
################

# si570_clk is generated by SI570 clock synthesizer and clk50/clk150 by clk_wiz_1
# There is no known phase relationship, hence they are treated  as asynchronous
set_clock_groups -asynchronous -group {clk50 clk150} -group si570_clk

# BUFGMUX selects one of the two external clocks for the video capture pipeline
# The two clocks are physically exclusive since they don't exist at the same time
set_clock_groups -physically_exclusive -group hdmii_clk -group si570_clk

#####################
# Timing Exceptions #
#####################

# Use fastest clock of the BUFGMUX as the path that timing analysis should be done on
# In this case, both clocks have the same period constraint, so either input 0 or input 1 can be selected
set_case_analysis 0 [get_pins system_top_i/fmc_hdmi_input/clock_mux_1/sel]

